---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices
source: html/f189eb3f-7a3a-2891-657a-e18cbf014987.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices

A collection of ids for external services that are managed and used by Revit directly.

## Syntax (C#)
```csharp
public static class BuiltInExternalServices
```